v_gutter_combustion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

domain
{
	dCells 20;
}

geometry
{
	v_gutter
	{
		type	triSurfaceMesh;
		file	"v_gutter.stl";
	}
	
	box
	{
		type	searchableBox;
		min		(-0.1 -1.911 0);
		max		(1.93 1.911 9.095);
	}
}

vertices
(
    (0.0 -4 -2)				// 0
    (0.0 -4 1.911)			// 1
    (0.0 -4 32)				// 2
    (0.0 -0.75 32)			// 3
    (0.0 -0.68992 32)		// 4
    (0.0 0.68992 32)		// 5
    (0.0 0.75 32)			// 6
    (0.0 4 32)				// 7
    (0.0 4 1.911)			// 8
    (0.0 4 -2)				// 9
    
    (0.0 0 0.35311)			// 10
    (0.0 -0.33924 0.60822)	// 11
    (0.0 -0.75 1.911)		// 12
    (0.0 -0.68992 1.9299)	// 13
    (0.0 -0.27658 0.619)	// 14
    (0.0 0 0.41621)			// 15
    (0.0 0.27658 0.619)		// 16
    (0.0 0.68992 1.9299)	// 17
    (0.0 0.75 1.911)		// 18
    (0.0 0.33924 0.60822)	// 19
    
	(9.095 -4 -2)				// 0	20
    (9.095 -4 1.911)			// 1	21
    (9.095 -4 32)				// 2	22
    (9.095 -0.75 32)			// 3	23
    (9.095 -0.68992 32)			// 4	24
    (9.095 0.68992 32)			// 5	25
    (9.095 0.75 32)				// 6	26
    (9.095 4 32)				// 7	27
    (9.095 4 1.911)				// 8	28
    (9.095 4 -2)				// 9	29
    
    (9.095 0 0.35311)			// 10	30
    (9.095 -0.33924 0.60822)	// 11	31
    (9.095 -0.75 1.911)			// 12	32
    (9.095 -0.68992 1.9299)		// 13	33
    (9.095 -0.27658 0.619)		// 14	34
    (9.095 0 0.41621)			// 15	35
    (9.095 0.27658 0.619)		// 16	36
    (9.095 0.68992 1.9299)		// 17	37
    (9.095 0.75 1.911)			// 18	38
    (9.095 0.33924 0.60822)		// 19	39
    (0.0 0 -2)					// 40
    (9.095 0 -2)				// 41
);

blocks
(
    hex (40 10 11 0 41 30 31 20) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1) 		//0
    hex (9 19 10 40 29 39 30 41) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//1
    hex (11 12 1 0 31 32 21 20) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//2
    hex (12 3 2 1 32 23 22 21) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//3
    hex (13 4 3 12 33 24 23 32) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//4
    hex (16 17 13 14 36 37 33 34) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//5
    hex (16 14 15 16 36 34 35 36) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//6
    hex (17 5 4 13 37 25 24 33) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//7
    hex (18 6 5 17 38 26 25 37) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//8
    hex (8 7 6 18 28 27 26 38) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//9
    hex (9 8 18 19 29 28 38 39) ($:domain.dCells $:domain.dCells $:domain.dCells) simpleGrading (1 1 1)		//10
);

edges
(

	arc 10 11 (0 -0.23264 0.44058)
	arc 14 15 (0 -0.18693 0.4845)
	arc 10 19 (0 0.23264 0.44058)
	arc 15 16 (0 0.18693 0.4845)
	arc 30 31 (9.095 -0.23264 0.44058)
	arc 34 35 (9.095 -0.18693 0.4845)
	arc 30 39 (9.095 0.23264 0.44058)
	arc 35 36 (9.095 0.18693 0.4845)

);

boundary
(
    frontAndBack
    {
        type wall;
        faces
        (
        	// back
        	(9 19 10 40)
            (9 8 18 19)
            (8 7 6 18)
            (18 6 5 17)
            (17 5 4 13)
            (16 17 13 14)
            (16 14 15 16)
            (13 4 3 12)
            (12 3 2 1)
            (11 12 1 0)
            (40 10 11 0)
            
            
            //front
            (29 39 30 41)
            (29 28 38 39)
            (28 27 26 38)
            (38 26 25 37)
            (37 25 24 33)
            (36 37 33 34)
            (36 34 35 36)
            (33 24 23 32)
            (32 23 22 21)
            (31 32 21 20)
            (41 30 31 20)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (40 41 20 0)
            (9 29 41 40)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 6 26 27)
            (6 5 25 26)
            (5 4 24 25)
            (4 3 23 24)
            (3 2 22 23)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (29 9 8 28)
            (28 8 7 27)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (20 21 1 0)
            (21 22 2 1)
        );
    }
    
    v_gutter
    {
    	type wall;
    	faces
    	(
    		(30 31 11 10)
    		(31 32 12 11)
    		(33 32 12 13)
    		(34 33 13 14)
    		(35 34 14 15)
    		(35 36 16 15)
    		(36 37 17 16)
    		(38 37 17 18)
    		(39 38 18 19)
    		(30 39 19 10)
    	);
    }
);

// ************************************************************************* //
