v_gutter_combustion/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8800;
        startFace       255200;
    }
    inlet
    {
        type            patch;
        nFaces          800;
        startFace       264000;
    }
    outlet
    {
        type            patch;
        nFaces          2000;
        startFace       264800;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       266800;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       267600;
    }
    v_gutter
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       268400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       272400;
    }
)

// ************************************************************************* //
