v_gutter_combustion/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    
    upperWall
    {
    	type            fixedValue;
    	value			uniform (0 0 0);
    }

    lowerWall
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }

    v_gutter
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }

    frontAndBack
    {
    	type			fixedValue;
    	value			uniform (0 0 0);
   	}
}


// ************************************************************************* //
