v_gutter_combustion/0/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{

	#includeEtc "caseDicts/setConstraintTypes"
	
    ".*"
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
