v_gutter_combustion/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;

    }
    
    lowerWall
    {
        type            zeroGradient;
    }
    
    upperWall
    {
        type            zeroGradient;
    }
    
    v_gutter
    {
    	type			zeroGradient;
    }
    
    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
