v_gutter_combustion/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

	#includeEtc "caseDicts/setConstraintTypes"
	
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    
    outlet
    {
        type            calculated;
        value			$internalField;
    }
    
    lowerWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    
    upperWall
    {
    	type			compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    
    v_gutter
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;;
    }
    
    frontAndBack
    {
    	type			compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
}


// ************************************************************************* //
