v_gutter_combustion/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 0 20);
pressure             101325;
turbulentKE          0.24;
turbulentEpsilon	 1.78;

// ************************************************************************* //
