v_gutter_combustion/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 30;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    //- Define inlet conditions
    
    inlet
    {
    	type			turbulentIntensityKineticEnergyInlet;
    	intensity		0.0628;
    	value			uniform 1;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    upperWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    v_gutter
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
    	type			kqRWallFunction;
    	value			$internalField;
    }
}


// ************************************************************************* //
